Revit 2024 API
Part Class
 This element represents a part of another element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class Part : Element
Visual Basic
Public Class Part _
	Inherits Element
Visual C++
public ref class Part : public Element
Remarks
 A part is associated with a PartMaker element that creates it.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Part
See Also
Part Members
Autodesk.Revit.DB Namespace